### Bibliotecas

In [1]:
import pandas as pd

### Criando DataFrames

In [3]:
df1 = pd.DataFrame({"nome": ["Caio", "Rodrigo", "Evandro", "Rafael"], "idade": [28,45,27,16]})

In [11]:
df1

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16

In [12]:
df2 = pd.DataFrame({"nome": ["Caio", "Mariane", "Maria"], "idade": [28,29,59]})

In [13]:
df2

      nome  idade
0     Caio     28
1  Mariane     29
2    Maria     59

### CONCAT simulando SQL UNION ALL

In [14]:
df = pd.concat([df1,df2])

In [15]:
df

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16
0     Caio     28
1  Mariane     29
2    Maria     59

In [17]:
df.reset_index(drop=True, inplace=True) # ou usar ignore_index=True dentro do CONCAT

In [18]:
df

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16
4     Caio     28
5  Mariane     29
6    Maria     59

### CONCAT simulando SQL UNION

In [19]:
DF = pd.concat([df1,df2]).drop_duplicates().reset_index(drop=True)

In [20]:
DF

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16
4  Mariane     29
5    Maria     59